cordx1 = input('Введите начальную координату фигуры "Конь" по X: ')
cordy1 = input('Введите начальную координату фигуры "Конь" по Y: ')
cordx2 = input('Введите координату для хода фигуры "Конь" по X: ')
cordy2 = input('Введите координату для хода фигуры "Конь" по Y: ')

x1 = int(cordx1)
y1 = int(cordy1)
x2 = int(cordx2)
y2 = int(cordy2)

dx = x1 - x2
dy = y1 - y2

if dx < 0:
    dx = -dx
if dy < 0:
    dy = -dy
if x1 == x2 and y1 == y2:
    print('"Конь" начальные координаты сопадают с новыми, конь остается на месте')
elif x1 <= 0 or y1 <= 0 or x2 <= 0 or y2 <= 0 or x1 > 8 or y1 > 8 or x2 > 8 or y2 > 8:
    print('Шахматная доска ограничена по координатам, вводите значения от 1 до 8')
elif dx == 1 and dy == 2 or dx == 2 and dy == 1:
    print('"Конь" из точки ', str(x1),':',str(y1), ' может двигатся в точку ', str(x2), ':', str(y2), sep='')
else:
    print('"Конь" так ходить не может')
